In [104]:
import numpy as np
import pandas as pd

In [105]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [106]:
data=pd.Series([1,2,3,4,5],index=["a","b","c","d","e"])
data

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [107]:
data.size

5

In [108]:
data.values

array([1, 2, 3, 4, 5], dtype=int64)

In [109]:
data["a"]

1

In [110]:
data.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [111]:
data.iloc[1],data.loc["a"]

(2, 1)

In [112]:
data.loc["a"::2],data.iloc[3]

(a    1
 c    3
 e    5
 dtype: int64,
 4)

In [113]:
data.loc[["a","c","e"]],data.iloc[3]

(a    1
 c    3
 e    5
 dtype: int64,
 4)

In [114]:
#dataframe
dictionary={
    "USN":[1,2,3,4],
    "name":["Acchu","kruthi","ram","jay"],
    "age":[22,21,25,16],
    "course":["MCA","MCA","BSC","PUC"],
    }

In [115]:
df=pd.DataFrame(dictionary)

In [116]:
df

   USN    name  age course
0    1   Acchu   22    MCA
1    2  kruthi   21    MCA
2    3     ram   25    BSC
3    4     jay   16    PUC

In [117]:
data=pd.read_csv(r"C:\Users\archana\OneDrive\Desktop\sample.csv")
data

,Unnamed: 0,EmpID,Name,Department,Age,Salary,Experience,JoiningDate,City,PerformanceScore
0,0,101,Ram,IT,25,50000,2,2021-01-15,Bangalore,4.5
1,1,102,Shyam,HR,30,45000,5,2019-03-10,Mumbai,3.8
2,2,103,Geeta,Finance,28,60000,4,2020-07-22,Delhi,4.2
3,3,104,Anita,IT,35,75000,10,2015-09-30,Bangalore,4.9
4,4,105,Kiran,HR,32,52000,7,2018-06-12,Mumbai,4.1
5,5,106,John,Finance,29,58000,3,2021-11-05,Delhi,3.9
6,6,107,Meena,IT,41,82000,15,2010-04-18,Bangalore,4.8
7,7,108,David,HR,26,48000,2,2022-02-14,Mumbai,3.7
8,8,109,Sara,Finance,38,61000,12,2013-12-01,Delhi,4.3
9,9,110,Arjun,IT,27,54000,4,2020-08-19,Bangalore,4.0
10,10,111,Ravi,HR,33,47000,6,2017-05-23,Mumbai,3.6
11,11,112,Priya,Finance,31,59000,5,2019-09-17,Delhi,4.4
12,12,113,Kunal,IT,45,90000,18,2008-03-11,Bangalore,4.9
13,13,114,Sneha,HR,29,51000,3,2021-07-29,Mumbai,3.5
14,14,115,Vijay,Finance,36,62000,11,2014-01-10,Delhi,4.2
15,15,116,Neha,IT,40,88000,14,2011-10-21,Bangalore,4.7
16,16,117,Amit,HR,34,53000,8,2016-04-05,Mumbai,4.0
17,17,118,Pooja,Finance,30,57000,6,2018-12-12,Delhi,4.1
18,18,119,Rahul,IT,28,56000,4,2020-02-28,Bangalore,3.9
19,19,120,Divya,HR,37,49500,9,2015-06-30,Mumbai,4.3

In [118]:
data.head()

,Unnamed: 0,EmpID,Name,Department,Age,Salary,Experience,JoiningDate,City,PerformanceScore
0,0,101,Ram,IT,25,50000,2,2021-01-15,Bangalore,4.5
1,1,102,Shyam,HR,30,45000,5,2019-03-10,Mumbai,3.8
2,2,103,Geeta,Finance,28,60000,4,2020-07-22,Delhi,4.2
3,3,104,Anita,IT,35,75000,10,2015-09-30,Bangalore,4.9
4,4,105,Kiran,HR,32,52000,7,2018-06-12,Mumbai,4.1

In [119]:
data.tail()

,Unnamed: 0,EmpID,Name,Department,Age,Salary,Experience,JoiningDate,City,PerformanceScore
15,15,116,Neha,IT,40,88000,14,2011-10-21,Bangalore,4.7
16,16,117,Amit,HR,34,53000,8,2016-04-05,Mumbai,4.0
17,17,118,Pooja,Finance,30,57000,6,2018-12-12,Delhi,4.1
18,18,119,Rahul,IT,28,56000,4,2020-02-28,Bangalore,3.9
19,19,120,Divya,HR,37,49500,9,2015-06-30,Mumbai,4.3

In [120]:
data.describe()

,Unnamed: 0,EmpID,Age,Salary,Experience,PerformanceScore
count,20.00000,20.00000,20.000000,20.000000,20.000000,20.000000
mean,9.50000,110.50000,32.700000,59875.000000,7.400000,4.190000
std,5.91608,5.91608,5.449288,13388.796377,4.615762,0.415363
min,0.00000,101.00000,25.000000,45000.000000,2.000000,3.500000
25%,4.75000,105.75000,28.750000,50750.000000,4.000000,3.900000
50%,9.50000,110.50000,31.500000,56500.000000,6.000000,4.150000
75%,14.25000,115.25000,36.250000,61250.000000,10.250000,4.425000
max,19.00000,120.00000,45.000000,90000.000000,18.000000,4.900000

In [121]:
data.shape

(20, 10)

In [122]:
data.sample()

,Unnamed: 0,EmpID,Name,Department,Age,Salary,Experience,JoiningDate,City,PerformanceScore
3,3,104,Anita,IT,35,75000,10,2015-09-30,Bangalore,4.9

In [123]:
data.Name

0       Ram
1     Shyam
2     Geeta
3     Anita
4     Kiran
5      John
6     Meena
7     David
8      Sara
9     Arjun
10     Ravi
11    Priya
12    Kunal
13    Sneha
14    Vijay
15     Neha
16     Amit
17    Pooja
18    Rahul
19    Divya
Name: Name, dtype: object

In [124]:
data["Name"]

0       Ram
1     Shyam
2     Geeta
3     Anita
4     Kiran
5      John
6     Meena
7     David
8      Sara
9     Arjun
10     Ravi
11    Priya
12    Kunal
13    Sneha
14    Vijay
15     Neha
16     Amit
17    Pooja
18    Rahul
19    Divya
Name: Name, dtype: object

In [125]:
data[["Name","Department","Salary"]]

     Name Department  Salary
0     Ram         IT   50000
1   Shyam         HR   45000
2   Geeta    Finance   60000
3   Anita         IT   75000
4   Kiran         HR   52000
5    John    Finance   58000
6   Meena         IT   82000
7   David         HR   48000
8    Sara    Finance   61000
9   Arjun         IT   54000
10   Ravi         HR   47000
11  Priya    Finance   59000
12  Kunal         IT   90000
13  Sneha         HR   51000
14  Vijay    Finance   62000
15   Neha         IT   88000
16   Amit         HR   53000
17  Pooja    Finance   57000
18  Rahul         IT   56000
19  Divya         HR   49500

In [126]:
type(data.Name)

pandas.core.series.Series

In [127]:
data=pd.read_csv(r"C:\Users\archana\OneDrive\Desktop\test2.csv")
data

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [128]:
data.isnull()

   Unnamed: 0   Name    Age  Department  Salary
0       False  False  False       False   False
1       False  False  False       False   False
2       False  False  False       False   False
3       False  False   True       False   False
4       False  False  False       False    True
5       False  False  False       False   False

In [129]:
data.loc["0":"1","Name":"Department"]

    Name   Age Department
0  Alice  25.0         HR
1    Bob  30.0         IT

In [130]:
data.loc["1":"3","Name":"Department"]

      Name   Age Department
1      Bob  30.0         IT
2  Charlie  35.0    Finance
3    David   NaN         IT

In [131]:
data.iloc[1:4,1:4]

      Name   Age Department
1      Bob  30.0         IT
2  Charlie  35.0    Finance
3    David   NaN         IT

In [132]:
data.rename(columns={"Name":"N","Age":"A","Departement":"D","Salary":"S"})# temprorly change the column names

   Unnamed: 0        N     A Department        S
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [133]:
data

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [134]:
data.rename(columns={"Name":"N","Age":"A","Department":"D","Salary":"S"},inplace=True)#pernmant change

In [135]:
data

   Unnamed: 0        N     A        D        S
0           0    Alice  25.0       HR  50000.0
1           1      Bob  30.0       IT  60000.0
2           2  Charlie  35.0  Finance  70000.0
3           3    David   NaN       IT  62000.0
4           4      Eve  29.0       HR      NaN
5           5    Alice  25.0       HR  50000.0

In [136]:
data.drop('Unnamed: 0',axis=1,inplace=True)#for columns Axis=1

In [96]:
data

         N     A        D        S
0    Alice  25.0       HR  50000.0
1      Bob  30.0       IT  60000.0
2  Charlie  35.0  Finance  70000.0
3    David   NaN       IT  62000.0
4      Eve  29.0       HR      NaN
5    Alice  25.0       HR  50000.0

In [138]:
data["updated_salary"]=data["S"]+5000

In [139]:
data

         N     A        D        S  updated_salary
0    Alice  25.0       HR  50000.0         55000.0
1      Bob  30.0       IT  60000.0         65000.0
2  Charlie  35.0  Finance  70000.0         75000.0
3    David   NaN       IT  62000.0         67000.0
4      Eve  29.0       HR      NaN             NaN
5    Alice  25.0       HR  50000.0         55000.0

In [144]:
data["updated_salary"]=data["S"].map(lambda x:x+10000)

In [145]:
data

         N     A        D        S  updated_salary
0    Alice  25.0       HR  50000.0         60000.0
1      Bob  30.0       IT  60000.0         70000.0
2  Charlie  35.0  Finance  70000.0         80000.0
3    David   NaN       IT  62000.0         72000.0
4      Eve  29.0       HR      NaN             NaN
5    Alice  25.0       HR  50000.0         60000.0

In [148]:
data.A.dtype

dtype('float64')

In [152]:
data.dropna(inplace=True)
data

         N     A        D        S  updated_salary
0    Alice  25.0       HR  50000.0         60000.0
1      Bob  30.0       IT  60000.0         70000.0
2  Charlie  35.0  Finance  70000.0         80000.0
5    Alice  25.0       HR  50000.0         60000.0

In [151]:
data.isnull().sum()

N                 0
A                 0
D                 0
S                 0
updated_salary    0
dtype: int64

In [157]:
data["A"]=data.A.astype("int")
data

         N   A        D        S  updated_salary
0    Alice  25       HR  50000.0         60000.0
1      Bob  30       IT  60000.0         70000.0
2  Charlie  35  Finance  70000.0         80000.0
5    Alice  25       HR  50000.0         60000.0

In [158]:
data[data["A"]>25]

         N   A        D        S  updated_salary
1      Bob  30       IT  60000.0         70000.0
2  Charlie  35  Finance  70000.0         80000.0

day 9 task1
(Product Catlog)creating a Series with custom labels and accessing specific data.

In [1]:
import pandas as pd

In [3]:
products = pd.Series(
    [700, 150, 300],
    index=['Laptop', 'Mouse', 'Keyboard']
)
products

Laptop      700
Mouse       150
Keyboard    300
dtype: int64

In [4]:
products.loc['Laptop']

700

In [6]:
products.iloc[0:2]

Laptop    700
Mouse     150
dtype: int64

day 9 task 2
The Grade Filter (Boolean Masking & Missing Data)

In [7]:
import pandas as pd

In [8]:
grades = pd.Series([85, None, 92, 45, None, 78, 55])

grades

0    85.0
1     NaN
2    92.0
3    45.0
4     NaN
5    78.0
6    55.0
dtype: float64

In [9]:
grades.isnull()

0    False
1     True
2    False
3    False
4     True
5    False
6    False
dtype: bool

In [10]:
filled_grades = grades.fillna(0)
filled_grades

0    85.0
1     0.0
2    92.0
3    45.0
4     0.0
5    78.0
6    55.0
dtype: float64

In [11]:
filtered_grades = filled_grades[filled_grades > 60]
filtered_grades

0    85.0
2    92.0
5    78.0
dtype: float64

day 9 task 3
The Username Formatter (Vectorized String Operations)

In [12]:
import pandas as pd

In [13]:
usernames = pd.Series([' Alice ', 'bOB', ' Charlie_Data ', 'daisy'])
usernames

0            Alice
1               bOB
2     Charlie_Data
3             daisy
dtype: object

In [14]:
cleaned_usernames = usernames.str.strip().str.lower()
cleaned_usernames

0           alice
1             bob
2    charlie_data
3           daisy
dtype: object

In [15]:
contains_a = cleaned_usernames.str.contains('a')
contains_a

0     True
1    False
2     True
3     True
dtype: bool